evidence/redis-persistence/2026-08-18-local/bench.out
Unable to find image 'redis:7' locally
7: Pulling from library/redis
84edf429c8ee: Pulling fs layer
23909f31123b: Pulling fs layer
4f4fb700ef54: Pulling fs layer
979d7b6b8254: Pulling fs layer
e194bf666bd6: Pulling fs layer
0f5d7465a5bb: Pulling fs layer
162ff2d67a4b: Pulling fs layer
4f4fb700ef54: Already exists
979d7b6b8254: Download complete
84edf429c8ee: Download complete
23909f31123b: Download complete
92d4fe874122: Download complete
162ff2d67a4b: Download complete
cef48e2d2a7e: Download complete
e194bf666bd6: Download complete
0f5d7465a5bb: Download complete
979d7b6b8254: Pull complete
162ff2d67a4b: Pull complete
0f5d7465a5bb: Pull complete
4f4fb700ef54: Pull complete
23909f31123b: Pull complete
e194bf666bd6: Pull complete
84edf429c8ee: Pull complete
Digest: sha256:e9b2e45ecd47fbb69b877cf8d045d5cccaaaed52524b6e098b4abe8212994f73
Status: Downloaded newer image for redis:7
== appendfsync=no ==
====== SET ======
  100000 requests completed in 0.49 seconds
  50 parallel clients
  32 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.047 milliseconds (cumulative count 17)
50.000% <= 0.143 milliseconds (cumulative count 51274)
75.000% <= 0.191 milliseconds (cumulative count 79356)
87.500% <= 0.207 milliseconds (cumulative count 88181)
93.750% <= 0.231 milliseconds (cumulative count 94971)
96.875% <= 0.255 milliseconds (cumulative count 96917)
98.438% <= 0.303 milliseconds (cumulative count 98509)
99.219% <= 0.351 milliseconds (cumulative count 99220)
99.609% <= 0.463 milliseconds (cumulative count 99617)
99.805% <= 0.943 milliseconds (cumulative count 99807)
99.902% <= 2.023 milliseconds (cumulative count 99905)
99.951% <= 2.207 milliseconds (cumulative count 99954)
99.976% <= 2.679 milliseconds (cumulative count 99976)
99.988% <= 2.735 milliseconds (cumulative count 99990)
99.994% <= 2.751 milliseconds (cumulative count 99995)
99.997% <= 2.759 milliseconds (cumulative count 99997)
99.998% <= 2.767 milliseconds (cumulative count 100000)
100.000% <= 2.767 milliseconds (cumulative count 100000)

Cumulative distribution of latencies:
27.491% <= 0.103 milliseconds (cumulative count 27491)
88.181% <= 0.207 milliseconds (cumulative count 88181)
98.509% <= 0.303 milliseconds (cumulative count 98509)
99.485% <= 0.407 milliseconds (cumulative count 99485)
99.668% <= 0.503 milliseconds (cumulative count 99668)
99.720% <= 0.607 milliseconds (cumulative count 99720)
99.735% <= 0.703 milliseconds (cumulative count 99735)
99.759% <= 0.807 milliseconds (cumulative count 99759)
99.786% <= 0.903 milliseconds (cumulative count 99786)
99.825% <= 1.007 milliseconds (cumulative count 99825)
99.855% <= 1.103 milliseconds (cumulative count 99855)
99.874% <= 1.207 milliseconds (cumulative count 99874)
99.890% <= 1.303 milliseconds (cumulative count 99890)
99.899% <= 2.007 milliseconds (cumulative count 99899)
99.935% <= 2.103 milliseconds (cumulative count 99935)
100.000% <= 3.103 milliseconds (cumulative count 100000)

Summary:
  throughput summary: 206185.56 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.150     0.040     0.143     0.239     0.335     2.767

== appendfsync=everysec ==
====== SET ======
  100000 requests completed in 0.48 seconds
  50 parallel clients
  32 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.047 milliseconds (cumulative count 4)
50.000% <= 0.143 milliseconds (cumulative count 53548)
75.000% <= 0.183 milliseconds (cumulative count 76177)
87.500% <= 0.207 milliseconds (cumulative count 89109)
93.750% <= 0.223 milliseconds (cumulative count 93853)
96.875% <= 0.271 milliseconds (cumulative count 96987)
98.438% <= 0.343 milliseconds (cumulative count 98533)
99.219% <= 0.423 milliseconds (cumulative count 99247)
99.609% <= 0.551 milliseconds (cumulative count 99624)
99.805% <= 0.847 milliseconds (cumulative count 99806)
99.902% <= 1.439 milliseconds (cumulative count 99904)
99.951% <= 1.671 milliseconds (cumulative count 99952)
99.976% <= 7.623 milliseconds (cumulative count 99978)
99.988% <= 7.655 milliseconds (cumulative count 99990)
99.994% <= 7.671 milliseconds (cumulative count 99995)
99.997% <= 7.679 milliseconds (cumulative count 99997)
99.998% <= 7.687 milliseconds (cumulative count 100000)
100.000% <= 7.687 milliseconds (cumulative count 100000)

Cumulative distribution of latencies:
30.870% <= 0.103 milliseconds (cumulative count 30870)
89.109% <= 0.207 milliseconds (cumulative count 89109)
97.832% <= 0.303 milliseconds (cumulative count 97832)
99.148% <= 0.407 milliseconds (cumulative count 99148)
99.517% <= 0.503 milliseconds (cumulative count 99517)
99.719% <= 0.607 milliseconds (cumulative count 99719)
99.757% <= 0.703 milliseconds (cumulative count 99757)
99.789% <= 0.807 milliseconds (cumulative count 99789)
99.850% <= 0.903 milliseconds (cumulative count 99850)
99.861% <= 1.007 milliseconds (cumulative count 99861)
99.872% <= 1.103 milliseconds (cumulative count 99872)
99.891% <= 1.407 milliseconds (cumulative count 99891)
99.904% <= 1.503 milliseconds (cumulative count 99904)
99.923% <= 1.607 milliseconds (cumulative count 99923)
99.954% <= 1.703 milliseconds (cumulative count 99954)
100.000% <= 8.103 milliseconds (cumulative count 100000)

Summary:
  throughput summary: 208333.34 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.149     0.040     0.143     0.239     0.391     7.687

== appendfsync=always ==
====== SET ======
  100000 requests completed in 5.46 seconds
  50 parallel clients
  32 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.615 milliseconds (cumulative count 1)
50.000% <= 2.159 milliseconds (cumulative count 50180)
75.000% <= 3.503 milliseconds (cumulative count 75014)
87.500% <= 4.087 milliseconds (cumulative count 87536)
93.750% <= 4.671 milliseconds (cumulative count 93782)
96.875% <= 5.471 milliseconds (cumulative count 96886)
98.438% <= 6.199 milliseconds (cumulative count 98442)
99.219% <= 7.375 milliseconds (cumulative count 99220)
99.609% <= 9.023 milliseconds (cumulative count 99610)
99.805% <= 11.991 milliseconds (cumulative count 99805)
99.902% <= 25.631 milliseconds (cumulative count 99903)
99.951% <= 55.647 milliseconds (cumulative count 99954)
99.976% <= 69.247 milliseconds (cumulative count 99976)
99.988% <= 69.439 milliseconds (cumulative count 99995)
99.997% <= 69.503 milliseconds (cumulative count 99998)
99.998% <= 70.207 milliseconds (cumulative count 99999)
99.999% <= 70.655 milliseconds (cumulative count 100000)
100.000% <= 70.655 milliseconds (cumulative count 100000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.007% <= 0.703 milliseconds (cumulative count 7)
0.557% <= 0.807 milliseconds (cumulative count 557)
1.188% <= 0.903 milliseconds (cumulative count 1188)
2.125% <= 1.007 milliseconds (cumulative count 2125)
2.910% <= 1.103 milliseconds (cumulative count 2910)
3.693% <= 1.207 milliseconds (cumulative count 3693)
4.351% <= 1.303 milliseconds (cumulative count 4351)
6.548% <= 1.407 milliseconds (cumulative count 6548)
12.215% <= 1.503 milliseconds (cumulative count 12215)
19.772% <= 1.607 milliseconds (cumulative count 19772)
26.504% <= 1.703 milliseconds (cumulative count 26504)
33.400% <= 1.807 milliseconds (cumulative count 33400)
38.616% <= 1.903 milliseconds (cumulative count 38616)
43.824% <= 2.007 milliseconds (cumulative count 43824)
47.988% <= 2.103 milliseconds (cumulative count 47988)
67.225% <= 3.103 milliseconds (cumulative count 67225)
87.771% <= 4.103 milliseconds (cumulative count 87771)
95.669% <= 5.103 milliseconds (cumulative count 95669)
98.275% <= 6.103 milliseconds (cumulative count 98275)
99.069% <= 7.103 milliseconds (cumulative count 99069)
99.443% <= 8.103 milliseconds (cumulative count 99443)
99.646% <= 9.103 milliseconds (cumulative count 99646)
99.735% <= 10.103 milliseconds (cumulative count 99735)
99.752% <= 11.103 milliseconds (cumulative count 99752)
99.815% <= 12.103 milliseconds (cumulative count 99815)
99.830% <= 13.103 milliseconds (cumulative count 99830)
99.856% <= 14.103 milliseconds (cumulative count 99856)
99.876% <= 15.103 milliseconds (cumulative count 99876)
99.884% <= 16.103 milliseconds (cumulative count 99884)
99.886% <= 18.111 milliseconds (cumulative count 99886)
99.900% <= 20.111 milliseconds (cumulative count 99900)
99.901% <= 21.103 milliseconds (cumulative count 99901)
99.950% <= 26.111 milliseconds (cumulative count 99950)
99.954% <= 56.127 milliseconds (cumulative count 99954)
99.966% <= 57.119 milliseconds (cumulative count 99966)
99.970% <= 69.119 milliseconds (cumulative count 99970)
99.998% <= 70.143 milliseconds (cumulative count 99998)
100.000% <= 71.103 milliseconds (cumulative count 100000)

Summary:
  throughput summary: 18325.09 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        2.685     0.608     2.159     4.927     6.839    70.655